In [1]:
# ETL PRoject

The aim of this project is to extract movies dataset from different sources, clean the data and insert into a postgres database. 
Technologies used will include:
Postgres Database
sqlalchemy library
Pandas
Source data willbe csv file pulled from imbd datasource

The dataset contains data on Movies, Actors and ratings. We intend to pull each dataset into a seperate table, and create joins that link actors to movies and ratings for insight into the dataset

In [1]:
import pandas as pd
import psycopg2
import sqlalchemy
import numpy as np
import matplotlib as plt
from sqlalchemy import create_engine, inspect
from datetime import datetime

In [2]:
# Database connection 
pg_port = '5432'
pg_username = 'postgres'
pg_pw = 'postgres'
pg_db = 'movies'
postgresDSN = ('postgresql://{}:{}@{}:{}/{}'.format(pg_username, pg_pw, 'localhost', pg_port, pg_db))
engine = create_engine(postgresDSN)
cnx = engine.connect()

In [ ]:
# create the database schema

query = f""" 

Drop Table IF EXISTS Movie_Actor CASCADE;  
Drop Table IF EXISTS Ratings CASCADE;  
Drop Table IF EXISTS Movies CASCADE;  
Drop Table IF EXISTS Actors CASCADE;  


CREATE TABLE  Actors  (
     actor_id  INT   NOT NULL,
     first_name  VARCHAR(255)   NOT NULL,
     last_name  VARCHAR(255)   NOT NULL,
     birth_name  VARCHAR(255),
     date_of_birth  DATE,
     place_of_birth  DATE,
     date_of_death  DATE,
     reason_of_death  text,
    CONSTRAINT  pk_Actors  PRIMARY KEY (
         actor_id 
     )
);

CREATE TABLE  Movies  (
     movie_id  INT   NOT NULL,
     title  text   NOT NULL,
     year  INT   NOT NULL,
     genre  VARCHAR(255)   NOT NULL,
     duration  INT,
     language  text,
     director  VARCHAR(255),
     actors  text   NOT NULL,
     description  text,
     avg_vote  float   NOT NULL,
     budget  float,
     gross_income  float,
     critic_reviews  float   NOT NULL,
    CONSTRAINT  pk_Movies  PRIMARY KEY (
         movie_id 
     )
);

CREATE TABLE  Ratings  (
     movie_id  INT   NOT NULL,
     avg_vote_females  float   NOT NULL,
     avg_vote_males  float   NOT NULL,
     total_votes  INT   NOT NULL,
     weighted_average_vote  float   NOT NULL,
    CONSTRAINT  pk_Ratings  PRIMARY KEY (
         movie_id 
     )
);

CREATE TABLE  Movie_Actor  (
     id  INT   NOT NULL,
     movie_id  INT   NOT NULL,
     actor_id  INT   NOT NULL,
     role  text,
     character  text,
    CONSTRAINT  pk_Movie_Actor  PRIMARY KEY (
         id 
     )
);

ALTER TABLE  Ratings  ADD CONSTRAINT  fk_Ratings_movie_id  FOREIGN KEY( movie_id )
REFERENCES  Movies  ( movie_id );

ALTER TABLE  Movie_Actor  ADD CONSTRAINT  fk_Movie_Actor_movie_id  FOREIGN KEY( movie_id )
REFERENCES  Movies  ( movie_id );

ALTER TABLE  Movie_Actor  ADD CONSTRAINT  fk_Movie_Actor_actor_id  FOREIGN KEY( actor_id )
REFERENCES  Actors  ( actor_id );

"""

In [3]:
data_source = 'Resources/'

In [4]:
movies_csv = data_source + 'IMDB movies.csv'
actors_csv = data_source + 'IMDB names.csv'
ratings_csv = data_source + 'IMDB ratings.csv'
title_principals = data_source + 'IMDb title_principals.csv'

In [141]:
actors = pd.read_csv(actors_csv, low_memory=False)

In [142]:
actors.head(3)

,imdb_name_id,name,birth_name,date_of_birth,place_of_birth,date_of_death,reason_of_death
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,1899-05-10,"Omaha, Nebraska, USA",6/22/87,pneumonia
1,nm0000002,Lauren Bacall,Betty Joan Perske,9/16/24,"The Bronx, New York City, New York, USA",8/12/14,stroke
2,nm0000003,Brigitte Bardot,Brigitte Bardot,9/28/34,"Paris, France",NaN,NaN

In [143]:
actors.rename(columns={'imdb_name_id':'actor_id'}, inplace=True)

In [144]:
actors_cols = ['actor_id','name','birth_name','date_of_birth','place_of_birth','date_of_death','reason_of_death']

In [145]:
actors = actors[actors_cols]

In [146]:
actors.head(3)

,actor_id,name,birth_name,date_of_birth,place_of_birth,date_of_death,reason_of_death
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,1899-05-10,"Omaha, Nebraska, USA",6/22/87,pneumonia
1,nm0000002,Lauren Bacall,Betty Joan Perske,9/16/24,"The Bronx, New York City, New York, USA",8/12/14,stroke
2,nm0000003,Brigitte Bardot,Brigitte Bardot,9/28/34,"Paris, France",NaN,NaN

In [115]:
# Cleaning currency column
def clean_currency(x):
    """ If the value is a string with currency symbol, split the string and 
    return numeric value. Else return original input. 
    """
    if isinstance(x, str):
        try: 
            return x.split()[1]
        except IndexError as e:
            return x
    return(x)

In [116]:
# Clean date columns - reove string from text from date 
def clean_date(x):
    for i in str(x).split():
        if i.isdigit():
            return i
        if i.isalpha():
            pass
        else:
            return x

In [119]:
# Check actor id, remover 'nm' prefix and returns numeric portion. Else skips the row if its not in 'nm000123' format
def clean_id(x):
    if x[2:].isdigit() and x[0:2] == 'nm':
        return x[2:]
    else:
        pass

In [147]:
# Clean the data
# Do after data confirm
actors['actor_id'] = actors['actor_id'].apply(lambda x: x.replace('nm', ''))
#actors['actor_id'] = actors['actor_id'].apply(lambda x: clean_id(x))
actors['first_name'] = actors.loc[:,'name'].apply(lambda x: x.split()[0])
actors['last_name'] = actors.loc[:,'name'].apply(lambda x: x.split()[1:])
actors['last_name'] = actors.loc[:,'last_name'].astype(str).apply(lambda x: x.strip('][').replace("'", ""))
actors['date_of_birth'] = actors.loc[:,'date_of_birth'].apply(lambda x: clean_date(x))
actors['date_of_death'] = actors.loc[:,'date_of_death'].apply(lambda x: clean_date(x))
actors = actors[['actor_id','first_name','last_name','birth_name','date_of_birth','place_of_birth','date_of_death','reason_of_death']]

In [148]:
actors.head(3)

,actor_id,first_name,last_name,birth_name,date_of_birth,place_of_birth,date_of_death,reason_of_death
0,0000001,Fred,Astaire,Frederic Austerlitz Jr.,1899-05-10,"Omaha, Nebraska, USA",6/22/87,pneumonia
1,0000002,Lauren,Bacall,Betty Joan Perske,9/16/24,"The Bronx, New York City, New York, USA",8/12/14,stroke
2,0000003,Brigitte,Bardot,Brigitte Bardot,9/28/34,"Paris, France",None,NaN

In [149]:
list(actors.columns)

['actor_id',
 'first_name',
 'last_name',
 'birth_name',
 'date_of_birth',
 'place_of_birth',
 'date_of_death',
 'reason_of_death']

### Movies Data

In [16]:
# 31016 ; 85855
movies = pd.read_csv(movies_csv, low_memory=False)

In [17]:
rename_cols = {
    'imdb_title_id':'movie_id',
    'worlwide_gross_income':'gross_income',
    'reviews_from_critics': 'critic_reviews'
}

In [18]:
movies.rename(columns=rename_cols, inplace=True)

In [19]:
movie_cols = ['movie_id','title','year','genre','duration','language','director','actors', \
             'description', 'avg_vote', 'budget','gross_income','critic_reviews']

In [20]:
movies = movies[movie_cols]

In [21]:
movies.head(3)

,movie_id,title,year,genre,duration,language,director,actors,description,avg_vote,budget,gross_income,critic_reviews
0,tt0000009,Miss Jerry,1894,Romance,45,None,Alexander Black,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,NaN,NaN,2.0
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",70,None,Charles Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,$ 2250,NaN,7.0
2,tt0001892,Den sorte drøm,1911,Drama,53,NaN,Urban Gad,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,NaN,NaN,2.0

In [44]:
movies['movie_id'] = movies['movie_id'].apply(lambda x: x.replace('tt', ''))
# movies['gross_income'] = movies.loc[:,'gross_income'].astype(str).apply(lambda x: x.replace('$',''))
#movies['budget'] = movies.loc[:,'budget'].astype(str).apply(lambda x: x.replace('$',''))
movies['gross_income'] = movies.loc[:,'gross_income'].apply(lambda x: clean_currency(x))
movies['budget'] = movies.loc[:,'budget'].apply(lambda x: clean_currency(x))
movies['year'] = movies.loc[:,'year'].apply(lambda x: clean_date(x))

In [45]:
movies.head(3)

,movie_id,title,year,genre,duration,language,director,actors,description,avg_vote,budget,gross_income,critic_reviews
0,0000009,Miss Jerry,1894,Romance,45,None,Alexander Black,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,NaN,NaN,2.0
1,0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",70,None,Charles Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,2250,NaN,7.0
2,0001892,Den sorte drøm,1911,Drama,53,NaN,Urban Gad,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,NaN,NaN,2.0

### Testing pages

In [43]:
# '0002101'
movies.loc[movies['movie_id'] == '8206668']

,movie_id,title,year,genre,duration,language,director,actors,description,avg_vote,budget,gross_income,critic_reviews
83917,8206668,Bad Education,TV Movie 2019,"Biography, Comedy, Crime",108,English,Cory Finley,"Hugh Jackman, Ray Romano, Welker White, Alliso...",The beloved superintendent of New York's Rosly...,7.1,NaN,NaN,98.0

In [24]:
movies.loc[movies['movie_id'] == '8206668']

,movie_id,title,year,genre,duration,language,director,actors,description,avg_vote,budget,gross_income,critic_reviews
83917,8206668,Bad Education,TV Movie 2019,"Biography, Comedy, Crime",108,English,Cory Finley,"Hugh Jackman, Ray Romano, Welker White, Alliso...",The beloved superintendent of New York's Rosly...,7.1,NaN,NaN,98.0

In [118]:
# Drop index of row with bad data 
movies.drop(index=83917, inplace=True)

In [46]:
test

,movie_id,title,year,genre,duration,language,director,actors,description,avg_vote,budget,gross_income,critic_reviews
7,0002445,Quo Vadis?,1913,"Drama, History",120,Italian,Enrico Guazzoni,"Amleto Novelli, Gustavo Serena, Carlo Cattaneo...","An epic Italian film ""Quo Vadis"" influenced ma...",6.2,45000,nan,5.0

In [70]:
# nullable columns: language, director, 
# not nullable but nulls found: actors:69 rows - changed it to nullable for now; 
movies.loc[movies['budget'].isnull()]

Empty DataFrame
Columns: [movie_id, title, year, genre, duration, language, director, actors, description, avg_vote, budget, gross_income, critic_reviews]
Index: []

In [75]:
#movies['budget'].isnull()

In [74]:
#movies.loc[movies['critic_reviews'].isna()]

In [ ]:
movies.loc[:,'budget'].astype(str).apply(lambda x: x.split())

In [90]:
def dob(x):
    if isinstance(x, str):
        for i in x.split():
            if i.isdigit():
                return i
            if i.isalpha():
                pass
            else:
                return x

In [103]:
def check_id(x):
    if x[2:].isdigit() and x[0:2] == 'nm':
        return x[2:]
    else:
        print('fail')

In [107]:
check_id('hello')

fail

In [233]:
y = 'the year 2.019'

In [235]:
y.split()

['the', 'year', '2.019']

In [248]:
for i in y.split():
    #print(i.isdigit())
    #print(isinstance(i, float))
    #print(i.isalpha())
    #print(i.isnumeric())
    print(type(i))

<class 'str'>
<class 'str'>
<class 'str'>

In [221]:
actors.dtypes

actor_id           object
first_name         object
last_name          object
birth_name         object
date_of_birth      object
place_of_birth     object
date_of_death      object
reason_of_death    object
dtype: object

In [177]:
t = '20-19-2020'

In [223]:
d = '9-09-2010'

mydate = datetime.strptime(d,'%d-%m-%Y').date()
mydate

datetime.date(2010, 9, 9)

In [185]:
a = '20-19-2020'
print(a.isnumeric())
print(a.isdigit())
print(a.isalpha())
print(a.isalnum())

False
False
False
False

In [181]:
p

['20-19-2020']

In [57]:
# 000786
actors.loc[actors['actor_id'] == 'enoir character']

Empty DataFrame
Columns: [actor_id, first_name, last_name, birth_name, date_of_birth, place_of_birth, date_of_death, reason_of_death]
Index: []

In [263]:
actors.drop(index=19222, inplace=True)

In [110]:
p = 'The year 2019'

In [141]:
for i in p.split():
    if i.isdigit():
        print(i)
    else:
        print('fail')

fail
fail
2019

In [127]:
#test2 = movies['movie_id'].head(10)
test2 = movies[['movie_id']].head(10).copy()

In [130]:
test2.loc[test2['movie_id'] == '0002423'] =

  movie_id
6  0002423

In [137]:
a = "year 2016"
b = a.split()

In [139]:
for i in b:
    print(i.isdigit())

False
True

### End Tests

In [25]:
list(movies.columns)

['movie_id',
 'title',
 'year',
 'genre',
 'duration',
 'language',
 'director',
 'actors',
 'description',
 'avg_vote',
 'budget',
 'gross_income',
 'critic_reviews']

### Ratings data

In [26]:
ratings = pd.read_csv(ratings_csv)

In [27]:
rename_cols = {
    'imdb_title_id':'movie_id',
    'females_allages_avg_vote':'avg_vote_females',
    'males_allages_avg_vote':'avg_vote_males'
}

In [28]:
ratings.rename(columns=rename_cols, inplace=True)

In [29]:
ratings_cols = ['movie_id','avg_vote_females','avg_vote_males','total_votes','weighted_average_vote']

In [30]:
ratings = ratings[ratings_cols]

In [31]:
ratings['movie_id'] = ratings['movie_id'].apply(lambda x: x.replace('tt', ''))

In [32]:
ratings.head(3)

,movie_id,avg_vote_females,avg_vote_males,total_votes,weighted_average_vote
0,0000009,6.0,6.2,154,5.9
1,0000574,6.2,6.1,589,6.1
2,0001892,5.7,5.9,188,5.8

In [33]:
list(ratings.columns)

['movie_id',
 'avg_vote_females',
 'avg_vote_males',
 'total_votes',
 'weighted_average_vote']

### movie_actors table

In [34]:
title_principalsDF = pd.read_csv(title_principals)

In [35]:
title_principalsDF.head(3)

,imdb_title_id,ordering,imdb_name_id,category,job,characters
0,tt0000009,1,nm0063086,actress,NaN,"[""Miss Geraldine Holbrook (Miss Jerry)""]"
1,tt0000009,2,nm0183823,actor,NaN,"[""Mr. Hamilton""]"
2,tt0000009,3,nm1309758,actor,NaN,"[""Chauncey Depew - the Director of the New Yor..."

In [36]:
rename_cols = {
    'imdb_title_id':'movie_id',
    'imdb_name_id':'actor_id'
}

In [37]:
title_principalsDF.rename(columns=rename_cols, inplace=True)

In [38]:
title_principalsDF['movie_id'] = title_principalsDF['movie_id'].apply(lambda x: x.replace('tt', ''))
title_principalsDF['actor_id'] = title_principalsDF['actor_id'].apply(lambda x: x.replace('nm', ''))

In [39]:
title_principalsDF.head(3)

,movie_id,ordering,actor_id,category,job,characters
0,0000009,1,0063086,actress,NaN,"[""Miss Geraldine Holbrook (Miss Jerry)""]"
1,0000009,2,0183823,actor,NaN,"[""Mr. Hamilton""]"
2,0000009,3,1309758,actor,NaN,"[""Chauncey Depew - the Director of the New Yor..."

In [40]:
list(title_principalsDF.columns)

['movie_id', 'ordering', 'actor_id', 'category', 'job', 'characters']

### Load Sql Tables

In [46]:
# read the data to tables:
movies.to_sql('movies', schema='public', con=cnx, if_exists='append', index=False)

In [150]:
actors.to_sql('actors', schema='public', con=cnx, if_exists='append', index=False)

In [152]:
ratings.to_sql('ratings', schema='public', con=cnx, if_exists='append', index=False)

In [153]:
title_principalsDF.to_sql('movie_actors', schema='public', con=cnx, if_exists='append', index=False)